app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE (2) LIMIT ?  [["LIMIT", 1]]
---
  def show
  @student = Student.find_by(params[:id])